*comment added by Github workflow: "Terraform"*

Workspace: "test-terraform-cloud-prod"

#### 🖌 Terraform Format and Style 🟢 `success`

#### ⚙️ Terraform Initialization 🟢 `success`

#### 🤖 Terraform Validation 🟢 `success`

#### 📖 Terraform Plan 🟢 `success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/a-mt/test-terraform-cloud-prod/runs/run-gbgsd6zxSmpAVazc

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...
google_storage_bucket.website: Refreshing state... [id=test-terraform-cloud-static-website]
google_storage_bucket_object.static_site_index: Refreshing state... [id=test-terraform-cloud-static-website-index.html]
google_storage_object_access_control.public_index_rule: Refreshing state... [id=test-terraform-cloud-static-website/index.html/allUsers]
google_storage_bucket_object.static_site_index: Drift detected (update)
google_storage_object_access_control.public_index_rule: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.static_site_index must be replaced
-/+ resource "google_storage_bucket_object" "static_site_index" {
      + content          = (sensitive value)
      ~ content_type     = "text/html; charset=utf-8" -> (known after apply)
      ~ crc32c           = "Bonxag==" -> (known after apply)
      ~ detect_md5hash   = "YtZnH+JJBbWyS8KLyHzK2A==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "test-terraform-cloud-static-website-index.html" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "YtZnH+JJBbWyS8KLyHzK2A==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/test-terraform-cloud-static-website/o/index.html?generation=1711213419541379&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "index.html"
      ~ output_name      = "index.html" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/test-terraform-cloud-static-website/o/index.html" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # google_storage_object_access_control.public_index_rule will be created
  + resource "google_storage_object_access_control" "public_index_rule" {
      + bucket       = "test-terraform-cloud-static-website"
      + domain       = (known after apply)
      + email        = (known after apply)
      + entity       = "allUsers"
      + entity_id    = (known after apply)
      + generation   = (known after apply)
      + id           = (known after apply)
      + object       = "index.html"
      + project_team = (known after apply)
      + role         = "READER"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + gcp_index_download_link = (known after apply)
  ~ gcp_index_url           = "https://storage.googleapis.com/download/storage/v1/b/test-terraform-cloud-static-website/o/index.html?generation=1711213419541379&alt=media" -> "http://storage.googleapis.com/test-terraform-cloud-static-website/index.html"

```

</details>